ТОИР_демо/src/DataProcessors/торо_ПодборОбъектовРемонтныхРабот/торо_ПодборОбъектовРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ПодборОбъектовРемонтныхРабот</name>
</mdclass:DataProcessor>

ТОИР_демо/src/InformationRegisters/торо_НастройкиДоступностиОбъектовРемонта/торо_НастройкиДоступностиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НастройкиДоступностиОбъектовРемонта</name>
  <resources>
    <name>ДоступностьПриПодборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступностьФлага</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>НомерСтрокиТаб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СтатусОРВУчете</name>
    <type>
      <types>EnumRef.торо_СтатусыОРВУчете</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_РемонтныеЦиклыОборудования/торо_РемонтныеЦиклыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РемонтныеЦиклыОборудования</name>
  <resources>
    <name>НеУчитыватьПростоиОборудования</name>
    <comment>Использовать плановую наработка во время простоя (т.е. планировать ТО по наработке во время простоя)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидЦепочки</name>
    <type>
      <types>CatalogRef.торо_ЦепочкиРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаОбъектовРемонтов</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Enums/торо_СтатусыОРВУчете/торо_СтатусыОРВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыОРВУчете</name>
  <enumValues>
    <name>ПринятоКУчету</name>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоКУчету</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСклад</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ОбъектыРемонта</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АдресМестонахождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетСерийныхЗапчастей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <comment>Организация-изготовитель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКОФ</name>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИсполнительРемонта</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.торо_ПриоритетыОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекСтатусВУчете</name>
    <type>
      <types>EnumRef.торо_СтатусыОРВУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАктив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонтаПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеРемонта</name>
    <type>
      <types>EnumRef.торо_УсловияРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/торо_СтруктурыОР/торо_СтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СтруктурыОР</name>
  <predefined>
    <items>
      <name>СтруктураПоМестонахождению</name>
      <description>Структура по местонахождению</description>
    </items>
    <items>
      <name>СтруктураПоТехнологическойПозиции</name>
      <description>Структура по технологической позиции</description>
    </items>
  </predefined>
  <attributes>
    <name>ИзменяетсяДокументами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенВводНовыхОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтроитсяАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРеквизитаОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ТОИР_демо/src/DataProcessors/торо_ПодборОбъектовРемонтныхРабот/Forms/ФормаПодбораОбъектовИЦепочекДляПланаГрафикаППР/Module.bsl
&НаКлиенте
Перем СостояниеДереваОР;

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(КлючНазначенияИспользования) Тогда
		Отказ = Истина;
		торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Обработка не предназначена для непосредственного использования.'"));
		возврат;
	КонецЕсли;
	
	ТекСтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
																				"НастройкиТОиР",
																				"ОсновнаяСтруктураИерархии",
																				Истина);
																				
	ВидПодбора = "ЦепочкиРемонтныхРабот";
	ЗапросЦепочки = Истина;
	
	Если Параметры.Свойство("ИспользоватьДокументыЖЦОборудования") Тогда
		ФОИспользоватьДокументыЖЦОборудования = Параметры.ИспользоватьДокументыЖЦОборудования;
	Иначе
		ФОИспользоватьДокументыЖЦОборудования = ПолучитьФункциональнуюОпцию("торо_ИспользоватьДокументыПринятияИСписанияОборудования");
	КонецЕсли;
	
	Если ФОИспользоватьДокументыЖЦОборудования Тогда
		ПолучитьСписокСтатусовНаСервере(СписокСтатусов,ВидПодбора);
	КонецЕсли;
	
	ЗаполнитьПараметрыИерархии();
	
	СтруктураПараметровИерархии = Новый Структура(
	"СтруктураИерархии,ИзменяетсяДокументами,СтроитсяАвтоматически,РеквизитОР,ТипРеквизитаОР,ИерархическийСправочник,РодительИерархии",
	ТекСтруктураИерархии, ИзменяетсяДокументами, СтроитсяАвтоматически, ИерархияРеквизитОР, ИерархияТипРеквизитаОР,ИерархическийСправочник);
	
	ЭтаФорма.ОрганизацияДляОтбора = ?(Параметры.Свойство("Организация"), Параметры.Организация, Справочники.Организации.ПустаяСсылка());
	ЭтаФорма.ПодразделениеДляОтбора = ?(Параметры.Свойство("Подразделение"), Параметры.Подразделение, Справочники.СтруктураПредприятия.ПустаяСсылка());
	ЭтаФорма.НеУчаствуетВПланировании = ?(Параметры.Свойство("НеУчаствуетВПланировании"), Параметры.НеУчаствуетВПланировании, Ложь);

	СтруктураПараметровФормы = Новый Структура(
	"ИмяФормы, СостояниеДереваОР, ОтборОбъектРемонта, СписокСтатусов, ВидПодбора, Организация, Подразделение, НеУчаствуетВПланировании",
	ЭтаФорма.ИмяФормы, Неопределено, Неопределено, СписокСтатусов, ВидПодбора, ЭтаФорма.ОрганизацияДляОтбора, ЭтаФорма.ПодразделениеДляОтбора, НеУчаствуетВПланировании);
	
	МассивСтруктурОР = Справочники.торо_ОбъектыРемонта.ПолучитьМассивСтрокДляЗаполненияДерева(СтруктураПараметровИерархии,СтруктураПараметровФормы);
	
	ЗаполнитьДеревоПриСозданииНаСервере(МассивСтруктурОР);
	
	Элементы.ОрганизацияДляОтбора.Видимость = ЗначениеЗаполнено(ЭтаФорма.ОрганизацияДляОтбора);
	Элементы.ПодразделениеДляОтбора.Видимость = ЗначениеЗаполнено(ЭтаФорма.ПодразделениеДляОтбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТекСтруктураИерархииПриИзменении(Элемент)
	
	ЗаполнитьДеревоНаСервере();
	
	Для каждого СтрокаДерева Из Дерево.ПолучитьЭлементы() Цикл
		
		Элементы.Дерево.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Истина);
		
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДерево
&НаКлиенте
Процедура ДеревоПередРазворачиванием(Элемент, Строка, Отказ)
	
	ТекДанные = Дерево.НайтиПоИдентификатору(Строка);
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.Ссылка) И НЕ ТекДанные.СвязиОбновлялись Тогда
		СтрокиДерева = ТекДанные.ПолучитьЭлементы();
		Если СтрокиДерева.Количество() > 0 Тогда
			СтруктураПараметровИерархии = Новый Структура(
			"СтруктураИерархии,ИзменяетсяДокументами,СтроитсяАвтоматически,РеквизитОР,ТипРеквизитаОР,ИерархическийСправочник",
			ТекСтруктураИерархии, ИзменяетсяДокументами, СтроитсяАвтоматически, ИерархияРеквизитОР, ИерархияТипРеквизитаОР,ИерархическийСправочник);
			
			СтруктураПараметровФормы = Новый Структура(
			"ИмяФормы, СостояниеДереваОР, ОтборОбъектРемонта, СписокСтатусов, Организация, Подразделение, НеУчаствуетВПланировании",
			ЭтаФорма.ИмяФормы, СостояниеДереваОР, Неопределено, СписокСтатусов, ЭтаФорма.ОрганизацияДляОтбора, ЭтаФорма.ПодразделениеДляОтбора, ЭтаФорма.НеУчаствуетВПланировании);
			
			МассивЭлементов = Новый Массив;
			Для Каждого СтрокаДерева Из СтрокиДерева Цикл
				МассивЭлементов.Добавить(СтрокаДерева.Ссылка);
			КонецЦикла;
			
			СтруктураДобавления = ПолучитьСтруктуруНовыхСтрок(ТекДанные.Ссылка, СтруктураПараметровИерархии,МассивЭлементов,СтруктураПараметровФормы);
		КонецЕсли;
		ТекДанные.СвязиОбновлялись = Истина;
		
		Для каждого СтрокаДерева Из СтрокиДерева Цикл
			
			Если СтруктураДобавления = Неопределено Тогда Продолжить; КонецЕсли;
			
			Для каждого ТекЭлем Из СтруктураДобавления Цикл
				Если ТекЭлем.Родитель <> СтрокаДерева.Ссылка Тогда
					Продолжить;
				КонецЕсли;
				НС = СтрокаДерева.ПолучитьЭлементы().Добавить();
				НС.Ссылка                        = ТекЭлем.ОбъектИерархии;
				НС.РеквизитДопУпорядочивания     = ТекЭлем.РеквизитДопУпорядочиванияОР;
				
				НС.РодительИерархии              = ТекЭлем.Родитель;
				НС.ПометкаУдаления               = ТекЭлем.ПометкаУдаления;
				НС.Картинка                      = ТекЭлем.ИндексКартинки;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	
	ТекОбъектРемонтаЦепочки = Элементы.Дерево.ТекущиеДанные;
	Если ТекОбъектРемонтаЦепочки = Неопределено ИЛИ ТипЗнч(ТекОбъектРемонтаЦепочки.Ссылка) <> Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
		Возврат;
	КонецЕсли;
	
	МассивЦепочек = ПолучитьВидыЦепочекНаСервере(ТекОбъектРемонтаЦепочки.Ссылка);
	
	ТаблицаЦепочек.Очистить();
	
	Для каждого Элем Из МассивЦепочек Цикл
		НС = ТаблицаЦепочек.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Элем);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанныеОР = Элементы.Дерево.ТекущиеДанные;
	
	Если НЕ ТекДанныеОР = Неопределено Тогда
		ВыборОбъектаРемонта(ТекДанныеОР.Ссылка);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаЦепочек
&НаКлиенте
Процедура ТаблицаЦепочекПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.ТаблицаЦепочек.ТекущиеДанные;
	ТаблицаВидовРемонта.Очистить();

	Если НЕ ТекСтрока = Неопределено Тогда
		МассивРемонтов = ПолучитьВидыРемонтаНаСервере(ТекСтрока.ВидЦепочки);
				
		Для каждого Элем Из МассивРемонтов Цикл
			НС = ТаблицаВидовРемонта.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Элем);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦепочекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыборЦепочки();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыборЦепочки();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьДеревоПриСозданииНаСервере(МассивСтруктурОР)
	
	НС = Дерево.ПолучитьЭлементы().Добавить();
	НС.Ссылка = ТекСтруктураИерархии;
	НС.Картинка = 4;
	НС.СвязиОбновлялись = Истина;
	
	Если СтроитсяАвтоматически Тогда
		РодительИерархии = Справочники[ИерархияТипРеквизитаОР].ПустаяСсылка();
	Иначе
		РодительИерархии = ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка");
	КонецЕсли;
	
	Для Каждого ЭлементКорневой Из МассивСтруктурОР Цикл
		Если ЭлементКорневой.РодительИерархии = РодительИерархии Тогда
			
			НСКорневая = НС.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НСКорневая,ЭлементКорневой);
			НСКорневая.Ссылка = ЭлементКорневой.ОбъектИерархии;
			НСКорневая.Картинка = ЭлементКорневой.ИндексКартинки;
			НСКорневая.РеквизитДопУпорядочивания = ЭлементКорневой.РеквизитДопУпорядочиванияОР;
			Для Каждого ЭлементПодчиненный Из МассивСтруктурОР Цикл
				Если ЭлементПодчиненный.РодительИерархии = ЭлементКорневой.ОбъектИерархии Тогда
					НСПодчиненная = НСКорневая.ПолучитьЭлементы().Добавить();
					ЗаполнитьЗначенияСвойств(НСПодчиненная,ЭлементПодчиненный);
					НСПодчиненная.Ссылка = ЭлементПодчиненный.ОбъектИерархии;
					НСПодчиненная.Картинка = ЭлементПодчиненный.ИндексКартинки;
					НСПодчиненная.РеквизитДопУпорядочивания = ЭлементПодчиненный.РеквизитДопУпорядочиванияОР;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыИерархии()
	
	Если ЗначениеЗаполнено(ТекСтруктураИерархии) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_СтруктурыОР.РазрешенВводНовыхОР,
		               |	торо_СтруктурыОР.ИзменяетсяДокументами,
		               |	торо_СтруктурыОР.СтроитсяАвтоматически,
					   |	торо_СтруктурыОР.РеквизитОР,
					   |	торо_СтруктурыОР.ТипРеквизитаОР
		               |ИЗ
		               |	Справочник.торо_СтруктурыОР КАК торо_СтруктурыОР
		               |ГДЕ
		               |	торо_СтруктурыОР.Ссылка = &СтруктураИерархии";
		Запрос.УстановитьПараметр("СтруктураИерархии",ТекСтруктураИерархии);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		ИзменяетсяДокументами  = Выборка.ИзменяетсяДокументами;
		СтроитсяАвтоматически  = Выборка.СтроитсяАвтоматически;
		ИерархияРеквизитОР	   = Выборка.РеквизитОР;
		ИерархияТипРеквизитаОР = Выборка.ТипРеквизитаОР;
		Если СтроитсяАвтоматически И ИерархияТипРеквизитаОР <> "" Тогда
			ИерархическийСправочник= Метаданные.Справочники[ИерархияТипРеквизитаОР].Иерархический;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоНаСервере()
	
	Дерево.ПолучитьЭлементы().Очистить();
	
	ИзменяетсяДокументами = ТекСтруктураИерархии.ИзменяетсяДокументами; 
	СтроитсяАвтоматически = ТекСтруктураИерархии.СтроитсяАвтоматически;
	ИерархияРеквизитОР = ТекСтруктураИерархии.РеквизитОР;
	ИерархияТипРеквизитаОР = ТекСтруктураИерархии.ТипРеквизитаОР;
	
	Если СтроитсяАвтоматически И ИерархияТипРеквизитаОР <> "" Тогда
		ИерархическийСправочник = Метаданные.Справочники[ИерархияТипРеквизитаОР].Иерархический;
	КонецЕсли;
	
	СтруктураПараметровИерархии = Новый Структура(
	"СтруктураИерархии,ИзменяетсяДокументами,СтроитсяАвтоматически,РеквизитОР,ТипРеквизитаОР,ИерархическийСправочник,РодительИерархии",
		ТекСтруктураИерархии, ИзменяетсяДокументами, СтроитсяАвтоматически, ИерархияРеквизитОР, ИерархияТипРеквизитаОР,ИерархическийСправочник);
		
	СтруктураПараметровФормы = Новый Структура(
	"ИмяФормы, СостояниеДереваОР, ОтборОбъектРемонта, СписокСтатусов, ВидПодбора, Организация, Подразделение, НеУчаствуетВПланировании",
	ЭтаФорма.ИмяФормы, Неопределено, Неопределено, СписокСтатусов, ВидПодбора, ЭтаФорма.ОрганизацияДляОтбора, ЭтаФорма.ПодразделениеДляОтбора, НеУчаствуетВПланировании);
	
	МассивСтруктурОР = Справочники.торо_ОбъектыРемонта.ПолучитьМассивСтрокДляЗаполненияДерева(СтруктураПараметровИерархии,СтруктураПараметровФормы);
	ЗаполнитьДеревоПриСозданииНаСервере(МассивСтруктурОР);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокСтатусовНаСервере(СписокСтатусов,ВидПодбора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_НастройкиДоступностиОбъектовРемонта.СтатусОРВУчете
	|ИЗ
	|	РегистрСведений.торо_НастройкиДоступностиОбъектовРемонта КАК торо_НастройкиДоступностиОбъектовРемонта
	|ГДЕ
	|	торо_НастройкиДоступностиОбъектовРемонта.ДоступностьПриПодборе";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОтображатьНепринятые = (НЕ ВидПодбора = "ВидПараметровНаработки"
						  И НЕ ВидПодбора = "НастройкаПодбораВводНачальныхДанныхСоВременем"
						  И НЕ ВидПодбора = "ВводНачальныхДанных");
	
	Пока Выборка.Следующий() Цикл
		Если ОтображатьНепринятые Тогда
			СписокСтатусов.Добавить(Выборка.СтатусОРВУчете);
		ИначеЕсли Не Выборка.СтатусОРВУчете = Перечисления.торо_СтатусыОРВУчете.НеПринятоКУчету Тогда
			СписокСтатусов.Добавить(Выборка.СтатусОРВУчете);
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруНовыхСтрок(Ссылка, ПараметрыСтруктурыИерархии, МассивЭлементов, СтруктураПараметровФормы)
	
	Возврат Справочники.торо_ОбъектыРемонта.ПолучитьСтруктуруНовыхСтрокДляДереваПриРазворачивании(Ссылка, ПараметрыСтруктурыИерархии,МассивЭлементов,СтруктураПараметровФормы); 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидыЦепочекНаСервере(ОбъектРемонта)
	
	СписокОтбора = Новый СписокЗначений;
	СписокОтбора.Добавить(ОбъектРемонта);
	СписокОтбора.Добавить(ОбъектРемонта.ТиповойОР);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_РемонтныеЦиклыОборудования.ВидЦепочки,
	|	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов
	|ИЗ
	|	РегистрСведений.торо_РемонтныеЦиклыОборудования КАК торо_РемонтныеЦиклыОборудования
	|ГДЕ
	|	торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов В (&СписокОтбора)";
	
	Запрос.УстановитьПараметр("СписокОтбора", СписокОтбора);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивЦепочек = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Структ = Новый Структура("ВидЦепочки, ГруппаОбъектовРемонтов");
		ЗаполнитьЗначенияСвойств(Структ, Выборка);
		МассивЦепочек.Добавить(Структ);
		
	КонецЦикла;
	
	Возврат МассивЦепочек;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидыРемонтаНаСервере(ВидЦепочки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка КАК ВидЦепочки,
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта
	|ИЗ
	|	Справочник.торо_ЦепочкиРемонта.ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
	|ГДЕ
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВидЦепочки);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	МассивРемонтов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Структ = Новый Структура("ВидЦепочки, ВидРемонта");
		ЗаполнитьЗначенияСвойств(Структ, Выборка);
		МассивРемонтов.Добавить(Структ);
		
	КонецЦикла;
	
	Возврат МассивРемонтов;
	
КонецФункции

&НаКлиенте
Процедура ВыборЦепочки()
	
	ВыделенныеСтроки = Элементы.ТаблицаЦепочек.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество()= 0 Тогда
		Если ТаблицаЦепочек.Количество() = 0 Тогда
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для текущего объекта ремонта не задано ни одной цепочки ремонта.'"));
		Иначе
		  // торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбраны цепочки ремонтов для подбора.'"));
		КонецЕсли;
	Иначе
		
		КоллекцияСтрок = ДеревоВыбрСтрок.ПолучитьЭлементы();
		КоллекцияСтрок.Очистить();
		
		ТекДанныеОР = Элементы.Дерево.ТекущиеДанные;
		Если Не ТекДанныеОР = Неопределено Тогда
			ТекОР = ТекДанныеОР.Ссылка;
			НС = КоллекцияСтрок.Добавить();
			НС.Объект = ТекОР;
			Для каждого Стр Из ВыделенныеСтроки Цикл
				ВыдСтрока = ТаблицаЦепочек.НайтиПоИдентификатору(Стр);
				
				Если НЕ ВыдСтрока = Неопределено Тогда
					
					Строки = НС.ПолучитьЭлементы();
					НовСтр = Строки.Добавить();
					НовСтр.Цепочка = ВыдСтрока.ВидЦепочки;
					
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЕсли;
		
		ОповеститьОВыборе(ДеревоВыбрСтрок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборОбъектаРемонта(ТекОР)
	
	Если ЗапросЦепочки Тогда
		Если ТаблицаЦепочек.Количество() = 0 Тогда
			
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для элемента дерева ОР ""%1"" нет цепочек ремонтов.'"),ТекОР));
			
		Иначе
			
			СписокЦепочек = Новый СписокЗначений;
			Для Каждого СтрокаТЗЦепочек Из ТаблицаЦепочек Цикл
				СписокЦепочек.Добавить(СтрокаТЗЦепочек.ВидЦепочки);
			КонецЦикла;
			
			Для Каждого СтрокаПометки Из СписокЦепочек Цикл
				СтрокаПометки.Пометка = Истина;
			КонецЦикла;
			
			СписокЦепочек.ПоказатьОтметкуЭлементов(Новый ОписаниеОповещения("ВыборОбъектаРемонтаЗавершение", ЭтотОбъект, Новый Структура("СписокЦепочек, ТекОР", СписокЦепочек, ТекОР)), НСтр("ru = 'Выбор цепочек ремонта'"));
		КонецЕсли;
	Иначе
		ОповеститьОВыборе(ТекОР);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыборОбъектаРемонтаЗавершение(Список, ДополнительныеПараметры) Экспорт
    
    СписокЦепочек = ДополнительныеПараметры.СписокЦепочек;
    ТекОР = ДополнительныеПараметры.ТекОР;
    
    
    Если ЗначениеЗаполнено(Список) Тогда
        
        КоллекцияСтрок = ДеревоВыбрСтрок.ПолучитьЭлементы();
        КоллекцияСтрок.Очистить();
        НС = КоллекцияСтрок.Добавить();
        НС.Объект = ТекОР;
        
        Для Каждого ЭлементСписка Из СписокЦепочек Цикл
            Если ЭлементСписка.Пометка Тогда
                
                Строки = НС.ПолучитьЭлементы();
                НовСтр = Строки.Добавить();
                НовСтр.Цепочка = ЭлементСписка.Значение;
                
            КонецЕсли; 
        КонецЦикла;
        
        ОповеститьОВыборе(ДеревоВыбрСтрок);
        
    КонецЕсли;

КонецПроцедуры

СостояниеДереваОР = Новый Структура("МассивОткрытыхОР",Новый Массив);

#КонецОбласти
